
## Plan Result (demo)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.storage_account.azurerm_private_endpoint.this[0]
* Update
  * module.storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.storage_account.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "emhrsapidemo"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "cft-demo-network-rg"
      + subnet_id                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/private-endpoints"
      + tags                     = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "demo"
          + "managedBy"           = "Evidence Management"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "emhrsapidemo"
          + private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-demo/providers/Microsoft.Storage/storageAccounts/emhrsapidemo"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-demo/providers/Microsoft.Storage/storageAccounts/emhrsapidemo"
        name                               = "emhrsapidemo"
        tags                               = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "demo"
            "managedBy"           = "Evidence Management"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2413,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->